In [1]:
import pandas as pd

**Cargar el archivo CSV "ejemplo"**

In [6]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

**Cargar el archivo Excel**

In [8]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

**Crear un data frame **

In [17]:
pd.read_csv('dataframe.csv')

   Nombre  Edad Genero    Id
0  Carmen    26      F  1743
1   Pedro    39      M  9264
2   Maria    28      F  8362
3   Julio    35      M  2537

**Crear un segundo dataframe**

In [26]:
pd.read_csv('dataframe2')

     Nombre Edad Genero    Id
0  Gabriela   27      F  1736
1    Carlos   36      M  3524
2     Samue  l22      M  9837
3      Jhon   29      M  7367

**Combinar los anteriores dataframes**

In [27]:
pd.read_csv('dataframe3')

     Nombre  Edad Genero    Id
0    Carmen    26      F  1743
1     Pedro    39      M  9264
2     Maria    28      F  8362
3     Julio    35      M  2537
4  Gabriela    27      F  1736
5    Carlos    36      M  3524
6    Samuel    22      M  9837
7      Jhon    29      M  7367